<a href="https://colab.research.google.com/github/Mann822/Praktikum-Basissdata/blob/main/Bab5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
1. Bagaimana cara memasukkan data ke tabel?

Contoh:

INSERT INTO mahasiswa (NIM, Nama, Alamat)
VALUES ('12345', 'Doni', 'Yogyakarta');

2. Bagaimana cara menghapus data dari tabel?

Contoh:

DELETE FROM mahasiswa
WHERE NIM = '12345';

ðŸ’¾ KUMPULAN KODE BAB 5 (TEXT-ONLY / COPY-PASTE READY)

Seperti permintaanmu, ini versi yang mudah disalin:

1. INSERT Data

INSERT INTO mahasiswa VALUES ('123', 'Rudi', 'Jl. Merapi 10');

INSERT INTO mahasiswa (NIM, Nama, Alamat)
VALUES ('321', 'Budi', 'Jl. Kaliurang 20'

2. SELECT Data

SELECT * FROM mahasiswa;

SELECT NIM, Nama FROM mahasiswa;

SELECT * FROM mahasiswa WHERE NIM = '123'

3. UPDATE Data

UPDATE mahasiswa
SET Nama = 'Rudi Wijaya'
WHERE NIM = '123';


4. DELETE Data

DELETE FROM mahasiswa
WHERE NIM = '123'

5. SELECT Dengan Kondisi

SELECT * FROM products WHERE prod_price > 20;

SELECT * FROM customers
WHERE cust_country = 'USA';

Ada empat perintah utama dalam DML:

1. INSERT â€“ memasukkan data baru ke tabel
2. SELECT â€“ menampilkan data
3. UPDATE â€“ mengubah data
4. DELETE â€“ menghapus data

Semua perintah ini berkaitan dengan isi tabel, bukan strukturnya.

1. INSERT (Memasukkan Data)

Insert digunakan untuk menambahkan baris baru ke tabel.

Ada 2 cara:

a. INSERT tanpa menyebut nama kolom

INSERT INTO nama_tabel
VALUES (isi1, isi2, isi3, ...);

b. INSERT dengan menyebut nama kolom

INSERT INTO nama_tabel (kolom1, kolom2, kolom3)
VALUES ('isi1', 'isi2', 'isi3');

Kelebihan: lebih aman karena tidak perlu mengisi semua kolom.

2. SELECT (Menampilkan Data)

Digunakan untuk melihat isi tabel.

a. Menampilkan semua data

SELECT * FROM nama_tabel;

b. Menampilkan kolom tertentu

SELECT kolom1, kolom2 FROM nama_tabel;

c. Menampilkan baris tertentu (menggunakan WHERE)

SELECT * FROM nama_tabel
WHERE kolom = 'nilai';

3. UPDATE (Mengubah Data)

Digunakan untuk memperbarui data pada baris tertentu.

Format:

UPDATE nama_tabel
SET kolom = 'nilai_baru'
WHERE kolom_kunci = 'nilai';

> Sangat penting: Gunakan WHERE, kalau tidak semua data akan ikut berubah.

4. DELETE (Menghapus Data)

Menghapus baris tertentu dari tabel.

Format:

DELETE FROM nama_tabel
WHERE kolom_kunci = 'nilai';

> Sama seperti UPDATE, WAJIB pakai WHERE, kalau tidak semua data terhapus.


5. SELECT Dengan Kondisi Tambahan (Operator Relasional)

Operator untuk membandingkan nilai:

Operator    Arti

=   sama dengan
>   lebih besar
<   lebih kecil
>=  lebih besar sama dengan
<=  lebih kecil sama dengan
<>  tidak sama dengan


Contoh:

SELECT * FROM products
WHERE prod_price >= 20;